{
    "name": "Ситдиков Ярослав",
    "university": "КГТУ им. Раззакова",
    "titleSkills": "Навыки",
    "skills": [
        {
            "id": 0,
            "name": "HTML / CSS",
            "title": "Знаю семантику тегов и как ею пользоваться, при написании HTML кода думаю о том, как его я потом буду верстать и придумываю адекватные название классов:",
            "list": [
                "Семантика тегов",
                "Формы и валидация",
                "Ссылка и навигация",
                "Адекватные названия классов"
            ]
        },
        {
            "id": 1,
            "title": "Могу спокойно сверстать адаптированный макет сайта используя современные инструменты для работы с CSS. Умение использовать CSS для создания различных макетов и позиционирования элементов на странице с помощью методов, таких как блочная модель, flexbox и grid. Знание принципов и техник создания адаптивного дизайна с использованием медиа-запросов",
            "list": [
                "Bootstrap",
                "Препроцессор scss",
                "Flexbox",
                "Методология БЭМ",
                "Получение стилей из Figma"
            ]
        },
        {
            "id": 2,
            "name": "JavaScript",
            "title": "Понимание основных концепций JavaScript, таких как переменные, функции, объекты, массивы, условные операторы и циклы. Отправка асинхронных запросов на сервер и обработка полученных данных без необходимости перезагрузки страницы. Использование промисов, асинхронных функций и ключевых слов async/await для управления асинхронными операциями и обработки результатов.",
            "list": [
                "Основы",
                "Работа с DOM элементами",
                "Ajax, Fetch, Axios",
                "Асинхронное программирование",
                "Фреймворки и библиотеки",
                "ES6"
            ]
        },
        {
            "id": 3,
            "name": "React",
            "title": "Глубокое понимание основ React.js, включая работу с компонентами, виртуальным DOM, жизненными циклами компонентов, контекстом и хуками. Умение эффективно использовать React для разработки масштабируемых и модульных пользовательских интерфейсов. Работа с JSX для создания декларативного кода пользовательского интерфейса. Знание различных подходов к управлению состоянием, таких как использование useState и Redux. Работа с библиотеками роутинга, React Router, для управления навигацией в приложении.",
            "list": [
                "Состояние и методы жизненного цикла",
                "Использование хуков",
                "Компоненты и пропсы",
                "CSS модули",
                "Использования библиотек: Material UI, Bootstrap, React Router",
                "Redux Toolkit"
            ]
        },
        {
            "id": 4,
            "name": "Git / GitHub",
            "list": [
                "Склонировать репозиторий или создать новый",
                "Работа с ветками",
                "Решение конфликтов"
            ]
        },
        {
            "id": 5,
            "name": "Docker",
            "list": [
                "Контейнеризация. Знание основных концепций и принципов контейнеризации, включая изоляцию приложений, упаковку зависимостей и запуск в различных средах.",
                "Создание образов: Опыт создания Docker-образов с использованием Dockerfile.",
                "Умение создавать и настраивать многоконтейнерные приложения с помощью Docker Compose."
            ]
        }
    ],

    "titleWorks": "Опыт работы",
    "works": [
        {
            "name": "Kurut-IT",
            "time": "Март 2023 - Июль 2023",
            "text": "Разрабатывал пользовательский интерфейс для веб-приложении с использованием библиотеки React / React Vite. Также разрабатывал веб-прототипы для мобильных приложений. Добавление адаптивного дизайна и отзывчивость для обеспечения удобного просмотра на различных устройствах. Использовал различные стилизованные фреймворки для повышение эффективности и поддержки стилей. Внедрял REST API для обмена данными между пользователями и сервером"
        }
    ]
}