export const content = {
    skills: [
        {
            id: 0,
            name: 'HTML / CSS',
            title: 'Знаю семантику тегов и как ею пользоваться, при написании html кода думаю о том, как его я потом буду верстать и придумываю адекватные название классов:',
            list: [
                'OG теги',
                'Адекватные названия классов',
            ]
        },
        {
            id: 1,
            title: 'Могу спокойно сверстать адаптированный макет сайта используя современные инструменты для работы с css, такие как:',
            list: [
                'Bootstrap',
                'Препроцессор scss',
                'Flexbox',
                'Методология БЭМ',
                'Получение стилей из Figma'
            ]
        },
        {
            id: 2,
            name: 'JavaScript',
            title: 'С удовольствием изучаю данный язык программирования и продолжаю дальше развивать свои навыки в нем:',
            list: [
                'Типы данных, контекст, область видимости(scope)',
                'Работа с массивами, а так же и их методы',
                'Асинхронность, Async/await, Promise',
                'EcmaScript 6',
            ]
        },
        {
            id: 3,
            name: 'React',
            title: 'С большим интересом изучаю данную библиотеку, знаю и практикую некоторые react инструменты, а именно:',
            list: [
                'Состояние и методы жизненного цикла',
                'Использование хуков',
                'Компоненты и пропсы',
                'CSS модули',
                'Использования библиотек: Material UI, Bootstrap, Route',
                'Redux Toolkit',
            ]
        },
        {
            id: 4,
            name: 'Git / GitHub',
            list: [
                'Склонировать репозиторий или создать свой',
                'Создание, изменение, удаление и слияние веток',
                'Решение конфликтов',
            ]
        },
    ],
    works: []
}