export const content = {
    skills: [
        {
            id: 0,
            name: 'HTML / CSS',
            title: 'Знаю семантику тегов и как ею пользоваться, при написании html кода думаю о том, как его я потом буду верстать и придумываю адекватные название классов:',
            list: [
                'OG теги',
                'Адекватные названия классов',
            ]
        },
        {
            id: 1,
            title: 'Могу спокойно сверстать адаптированный макет сайта используя современные инструменты для работы с css',
            list: [
                'Bootstrap',
                'Препроцессор scss',
                'Flexbox',
                'Методология БЭМ',
                'Получение стилей из Figma'
            ]
        },
        {
            id: 2,
            name: 'JavaScript',
            title: 'Понимание основных концепций JavaScript, таких как переменные, функции, объекты, массивы, условные операторы и циклы. Отправка асинхронных запросов на сервер и обработка полученных данных без необходимости перезагрузки страницы. Использование промисов, асинхронных функций и ключевых слов async/await для управления асинхронными операциями и обработки результатов.',
            list: [
                'Основы',
                'Работа с DOM элементами',
                'Ajax, Fetch, Axios',
                'Асинхронное программирование',
                'Фреймворки и библиотеки',
                'ES6'
            ]
        },
        {
            id: 3,
            name: 'React',
            title: 'С большим интересом изучаю данную библиотеку, знаю и практикую некоторые react инструменты, а именно:',
            list: [
                'Состояние и методы жизненного цикла',
                'Использование хуков',
                'Компоненты и пропсы',
                'CSS модули',
                'Использования библиотек: Material UI, Bootstrap, Route',
                'Redux Toolkit',
            ]
        },
        {
            id: 4,
            name: 'Git / GitHub',
            list: [
                'Склонировать репозиторий или создать свой',
                'Работа с ветками',
                'Решение конфликтов',
            ]
        },
    ],
    works: [
        {
            name: 'Kurut-IT',
            // time: 'Март 2023 - 3.3.2023',
            time: 'Текущее место работы',
            text: 'Разрабатывал пользовательский интерфейс для веб-приложении с использованием библиотеки React / React Vite. Также разрабатывал веб-прототипа для мобильных приложений. Добавление адаптивного дизайна и отзывчивость для обеспечения удобного просмотра на различных устройствах. Использовал различные стилизованные фреймворки для повышение эффективности и поддержки стилей. Внедрял REST API для обмена данными между пользователями и сервером'
        }
    ]
}